{
  "Name": "Adam of Eternia",
  "Type": "PC",
  "Race": "Human",
  "Class": "Barbarian",
  "Level": 5,
  "Background": "Noble",
  "Alignment": "Lawful Good",
  "Strength": 20,
  "Dexterity": 14,
  "Constitution": 16,
  "Intelligence": 10,
  "Wisdom": 13,
  "Charisma": 14,
  "ArmorClass": 15,
  "MaxHp": 55,
  "CurrentHp": 55,
  "TemporaryHp": 0,
  "Initiative": 2,
  "Speed": "40 ft",
  "PassivePerception": 11,
  "SavingThrowProficiencies": ["Strength", "Constitution"],
  "SkillProficiencies": ["Athletics", "Intimidation", "Persuasion", "Animal Handling"],
  "ToolProficiencies": [],
  "Languages": ["Common", "Elvish", "Giant"],
  "IsSpellcaster": false,
  "SpellcastingAbility": null,
  "SpellSaveDC": null,
  "SpellAttackBonus": null,
  "Cantrips": [],
  "SpellsKnown": [],
  "SpellSlots": {},
  "SpellSlotsUsed": {},
  "Equipment": [
    "Greatsword of Grayskull (magical, +1)",
    "Traveler's Clothes",
    "Fine Clothes (prince's garb)",
    "Signet Ring of House Eternia",
    "Belt of Giant Strength (flavor item)",
    "Leather harness and bracers",
    "Bedroll",
    "Waterskin",
    "Small portrait of his mother",
    "Journal for writing poetry"
  ],
  "Weapons": ["Greatsword of Grayskull", "Handaxe", "4 Javelins"],
  "CopperPieces": 0,
  "SilverPieces": 0,
  "GoldPieces": 250,
  "PlatinumPieces": 10,
  "PersonalityTraits": "I believe true strength comes from protecting others, not dominating them. I am not afraid to show my emotions—tears, joy, fear—because hiding them only makes us weaker. I always take time to listen to those in need, even in the heat of battle.",
  "Ideals": "Compassion. The measure of a hero is not how many foes they defeat, but how many lives they uplift. Power without empathy is tyranny.",
  "Bonds": "I carry the Sword of Grayskull, a blade passed down through my family that grants me incredible power—but only when I fight for justice. I am bound to my homeland and its people, especially my mother, whose wisdom guides me even from afar. I have sworn to protect the innocent from the skeletal tyrant who would enslave the world.",
  "Flaws": "I am TERRIFIED of lightning. The flash, the crack of thunder—it freezes me completely. This fear stems from the night the Storm Wizard attacked my kingdom and nearly killed everyone I loved. When storms rage, I become almost useless, trembling and unable to act. I also struggle with the burden of being a symbol of hope—sometimes I just want to be Adam, not the champion everyone needs.",
  "Backstory": "Prince Adam of Eternia was born to be a hero, but not the kind anyone expected. Yes, he is impossibly strong—when he raises the Sword of Grayskull and channels its ancient power, he becomes one of the mightiest warriors in the realm. But Adam's true strength has always been his heart.\n\nGrowing up in Castle Grayskull, Adam was taught by his mother that compassion was the greatest power of all. While his father pushed him toward martial perfection, Adam found equal joy in poetry, in caring for wounded animals, and in listening to the troubles of common folk. He learned to fight, yes, but he also learned to feel deeply.\n\nThen came the Night of Black Lightning. The Storm Wizard Tempestros, allied with the skeletal warlord who sought to conquer Eternia, called down a devastating magical storm. Lightning shattered the castle walls, struck down guards, and nearly killed Adam's beloved battle cat companion. Adam watched helplessly as blue-white death rained from the sky. Though he eventually drove back the attackers, the trauma left its mark. Now, at the first crack of thunder, the mightiest man in the realm trembles like a child.\n\nAdam doesn't hide this fear. He has learned that acknowledging weakness makes him more relatable to those he protects, and that even heroes need comfort sometimes. He ventures forth now, seeking to stop the forces of darkness while wrestling with his own inner storms. The Sword of Grayskull hums with power at his side, but Adam knows the real battle is proving that strength and sensitivity can coexist—that crying doesn't make you weak, and that being afraid doesn't mean you can't be brave.",
  "Conditions": [],
  "StatusNotes": "Frightened condition when lightning/thunder is present",
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null
}
