{
  "Name": "Buddy",
  "Type": "PC",
  "Race": "Human (Variant)",
  "Class": "Bard",
  "Level": 1,
  "Background": "Entertainer",
  "Alignment": "Chaotic Good",
  "Strength": 12,
  "Dexterity": 10,
  "Constitution": 14,
  "Intelligence": 10,
  "Wisdom": 8,
  "Charisma": 16,
  "ArmorClass": 11,
  "MaxHp": 10,
  "CurrentHp": 10,
  "TemporaryHp": 0,
  "Initiative": 0,
  "Speed": "30 ft",
  "PassivePerception": 9,
  "SavingThrowProficiencies": ["Dexterity", "Charisma"],
  "SkillProficiencies": ["Performance", "Acrobatics", "Persuasion", "Animal Handling", "Insight", "Perception"],
  "ToolProficiencies": ["Carpenter's Tools (Toymaking)", "Disguise Kit", "Lute"],
  "Languages": ["Common", "Elvish", "Sylvan"],
  "IsSpellcaster": true,
  "SpellcastingAbility": "Charisma",
  "SpellSaveDC": 13,
  "SpellAttackBonus": 5,
  "Cantrips": ["Friends", "Prestidigitation"],
  "SpellsKnown": [
    "Animal Friendship",
    "Charm Person",
    "Healing Word",
    "Speak with Animals"
  ],
  "SpellSlots": { "1": 2 },
  "SpellSlotsUsed": { "1": 0 },
  "Equipment": [
    "Green elf tunic with gold trim (North Pole issue)",
    "Yellow tights",
    "Pointed elf shoes with curled toes and bells",
    "Pointed elf hat with jingle bell",
    "Belt with jingle bells",
    "Leather armor (worn under tunic)",
    "Entertainer's pack",
    "Carpenter's tools (toymaking specialty)",
    "Etch-a-Sketch (masterwork, beloved)",
    "Snow globe of a great city",
    "Jack-in-the-box (first toy made with Papa Elf)",
    "Bottle of maple syrup (emergency supplies)",
    "Several candy canes",
    "Small bag of sugar",
    "Letter from Papa Elf",
    "Children's book: 'Santa Claus is Coming to Town'"
  ],
  "Weapons": ["Quarterstaff (candy cane striped)", "Snowballs (improvised weapons, 1d4 bludgeoning)"],
  "CopperPieces": 0,
  "SilverPieces": 0,
  "GoldPieces": 15,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I LOVE smiling! Smiling's my favorite! I treat everyone like a friend until they prove otherwise—and even then, I keep trying. I sing constantly, especially when decorating or when I'm happy, which is always. The best way to spread Christmas cheer is singing loud for all to hear! I've never met an animal that wasn't immediately my friend.",
  "Ideals": "Joy. The world is full of wonder if you look at it right. Cynicism is just sadness wearing a disguise. Every person, even the grumpiest, has a little Christmas spirit inside them—you just have to help them find it. Family isn't about blood; it's about who shows up.",
  "Bonds": "Papa Elf raised me as his own and taught me everything about being an elf—he'll always be my real father. Santa believed in me when I doubted myself. My father Walter needed someone to remind him what matters; I'm glad I found him. Jovie taught me that even non-elves can believe in Christmas. Mr. Narwhal is my best friend—he told me where to find my dad.",
  "Flaws": "I have absolutely no understanding of when I'm being inappropriate. I trust everyone completely, which people in the big city find 'unsettling.' I cannot lie—it physically confuses me. When someone I love rejects me, I don't know how to cope. I may have a sugar dependency. Also, I sit on things that aren't meant to be sat on, and I'm very tall.",
  "Backstory": "Buddy never meant to leave the orphanage. He was just a curious baby, and Santa's sack of toys looked warm and inviting, and the next thing anyone knew, he was at the North Pole surrounded by elves who had never seen a human infant before.\n\nPapa Elf took him in. Raised him as his own. Taught him the craft of toymaking, the joy of Christmas, the importance of spreading cheer. Buddy grew up believing he was an elf—just a very tall elf with very large hands who couldn't quite make the quota at the Etch-a-Sketch station. He sang. He decorated. He befriended every animal in the Pole, especially Mr. Narwhal, who became his confidant and swimming companion.\n\nFor thirty years, Buddy was perfectly happy.\n\nThen Papa Elf told him the truth: Buddy was human. His mother had passed away. His father—Walter Hobbs—lived in a place called New York City and had no idea Buddy existed. And he was on the Naughty List.\n\nSo Buddy did what any devoted son would do. He walked through the Candy Cane Forest, through the Lincoln Tunnel, and arrived in the greatest city in the world dressed in full elf regalia with nothing but maple syrup and an unshakeable belief that his father would love him.\n\nNew York was... confusing.\n\nEveryone moved so fast. They didn't smile. They didn't sing. The coffee tasted like hot brown water. The department store Santa was clearly a fraud—Buddy could *smell* it. And his father—Walter—was a grumpy man who published children's books without ever reading them, who cared more about profit margins than bedtime stories, and who wanted nothing to do with a six-foot-three elf claiming to be his son.\n\n*\"You're an angry elf,\"* Buddy observed, which did not help.\n\nBut Buddy didn't give up. He decorated. He sang. He made everyone uncomfortable with his sincerity until they started to believe it. He fell in love with Jovie, a woman who had forgotten how to sing in public until he reminded her. He won a snowball fight against bullies through sheer tactical excellence. He exposed a fake Santa in the middle of a packed department store.\n\nAnd when Christmas Eve came and the sleigh crashed in Central Park because there wasn't enough Christmas spirit to keep it flying, Buddy did the only thing he knew how to do: he sang. Loudly. For all to hear. And one by one, the people of New York joined in, and the sleigh rose, and Christmas was saved.\n\nWalter came around. He quit his job. He published Buddy's autobiography. The family learned to be a family.\n\nBut Buddy had discovered something important in that strange, wonderful city: there were people everywhere who had forgotten how to believe. Who needed someone to remind them that magic was real, that family mattered, that singing could save the world.\n\nSo Buddy packed his snow globe and his maple syrup and his carpenter's tools, hugged Papa Elf, got advice from Mr. Narwhal, and set off into the wider world.\n\nSomewhere out there, someone needs reminding that smiling's a great way to spend your face.\n\nBuddy's going to find them.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null,
  "Feats": ["Inspiring Leader"],
  "ClassFeatures": ["Bardic Inspiration (d6)", "Spellcasting"],
  "BardicInspirationDice": "d6",
  "BardicInspirationUses": 3,
  "SpecialAbilities": ["Animal Friendship (natural affinity)", "Fake Santa Detection", "Legendary Snowball Combat"]
}
