{
  "Name": "Gandalf",
  "Type": "PC",
  "Race": "Aasimar (Protector)",
  "Class": "Cleric (Light Domain)",
  "Level": 1,
  "Background": "Acolyte",
  "Alignment": "Neutral Good",
  "Strength": 8,
  "Dexterity": 10,
  "Constitution": 13,
  "Intelligence": 12,
  "Wisdom": 16,
  "Charisma": 15,
  "ArmorClass": 13,
  "MaxHp": 9,
  "CurrentHp": 9,
  "TemporaryHp": 0,
  "Initiative": 0,
  "Speed": "30 ft",
  "PassivePerception": 13,
  "SavingThrowProficiencies": ["Wisdom", "Charisma"],
  "SkillProficiencies": ["Insight", "Religion", "Perception", "Persuasion"],
  "ToolProficiencies": [],
  "Languages": ["Common", "Celestial", "Elvish", "Dwarvish"],
  "IsSpellcaster": true,
  "SpellcastingAbility": "Wisdom",
  "SpellSaveDC": 13,
  "SpellAttackBonus": 5,
  "Cantrips": ["Light", "Sacred Flame", "Thaumaturgy"],
  "SpellsKnown": [
    "Burning Hands (Domain)",
    "Faerie Fire (Domain)",
    "Bless",
    "Cure Wounds",
    "Guiding Bolt",
    "Sanctuary"
  ],
  "SpellSlots": { "1": 2 },
  "SpellSlotsUsed": { "1": 0 },
  "Equipment": [
    "Scale mail (grey robes over it)",
    "Shield (worn wooden, travel-scarred)",
    "Holy symbol (silver pendant, gift from Valinor)",
    "Traveler's pack",
    "Prayer book (filled with ancient hymns and star-charts)",
    "5 sticks of incense",
    "Vestments (grey traveling robes and pointed hat)",
    "Set of common clothes",
    "Pipe and pouch of Old Toby pipeweed",
    "Walking staff",
    "Fireworks (small collection, for special occasions)"
  ],
  "Weapons": ["Mace (walking staff, reflavored)", "Light Crossbow", "20 Crossbow Bolts"],
  "CopperPieces": 0,
  "SilverPieces": 0,
  "GoldPieces": 15,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I find wisdom in the smallest and most overlooked creatures—hobbits have taught me more than most kings. I prefer to advise rather than command; true change must come from within. Close friends call me 'Gandy Candy,' though I pretend to be annoyed by it. A good pipe and pleasant company are treasures beyond gold.",
  "Ideals": "Hope. Even the smallest person can change the course of the future. Despair is the only true defeat, and I will never succumb to it while there is a single candle yet to light against the darkness.",
  "Bonds": "I was sent to this world by powers beyond mortal comprehension to oppose the Shadow in all its forms. I do not fully understand my purpose, but I know that free peoples—humans, elves, dwarves, hobbits—must be united against the coming darkness. The wise and the small deserve my protection above all.",
  "Flaws": "I doubt whether I am truly equal to this task. When I was chosen to come here, I said I was afraid—afraid of the Enemy, afraid of failure. Sometimes I wonder if the Valar chose wrongly. I also have a weakness for pipe-weed, good food, and long conversations that make me late for everything.",
  "Backstory": "In the beginning, before sun or moon or stars, there was the Music—the great song of creation sung by the Ainur in the Timeless Halls. Among those spirits was one named Olórin, a Maia of particular gentleness, who served in the gardens of Lórien where dreams are woven, and sat at the feet of Nienna, the Lady of Mercy, learning pity and patience from her tears.\n\nOlórin loved the Children of Ilúvatar—elves and men—and walked among them unseen in the ages of the world, putting fair visions into their hearts and stirring them to hope. He was wise, perhaps the wisest of all his kind, but his wisdom was born not from pride but from compassion.\n\nWhen the Shadow began to stir again in Middle-earth and the Dark Lord gathered his strength, the Valar held council. They would send emissaries—the Istari, Wizards in the tongues of men—to advise and inspire the free peoples against Sauron's return. But the Istari could not use their full divine power; they would walk in the bodies of old men, limited and mortal-seeming, forbidden from dominating the wills of those they came to help.\n\nOlórin was chosen.\n\nHe did not want to go. Standing before the Valar, he confessed his fear: \"I am not equal to this task. The Enemy is mighty, and I am afraid of him.\" But the Valar saw in his humility the very quality that made him right for the mission. \"That,\" they said, \"is all the more reason why you should go.\"\n\nAnd so Olórin took the form of a grey-cloaked wanderer with a wooden staff, a pointed hat, and a fondness for fireworks. He took the name Gandalf among the northern men, Mithrandir among the elves, and began his long journey through the lands of Middle-earth.\n\nNow he walks the roads between kingdoms, seeking signs of the Shadow's return. He has learned to love the simple folk—the hobbits of the Shire with their gardens and their second breakfasts, who call him \"the Wandering Wizard\" and whisper that his fireworks are the finest in the land. Some of his closer companions, with more cheek than sense, have taken to calling him \"Gandy Candy,\" a nickname he pretends to disapprove of but secretly finds endearing.\n\nHe carries no great army, commands no fortress, wields no scepter of power. He has only his staff, his wisdom, his faith in the small and the overlooked, and the light of the Valar burning steady in his heart.\n\nIt will have to be enough.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null,
  "DomainSpells": ["Burning Hands", "Faerie Fire"],
  "ChannelDivinity": ["Turn Undead"],
  "ClassFeatures": ["Warding Flare", "Spellcasting", "Channel Divinity (1/rest)"],
  "RacialTraits": ["Darkvision 60ft", "Celestial Resistance (Necrotic, Radiant)", "Healing Hands", "Light Bearer (Light cantrip)"]
}
