{
  "Name": "Katniss Everdeen",
  "Type": "PC",
  "Race": "Human (Variant)",
  "Class": "Ranger",
  "Level": 1,
  "Background": "Outlander",
  "Alignment": "Chaotic Good",
  "Strength": 10,
  "Dexterity": 16,
  "Constitution": 14,
  "Intelligence": 12,
  "Wisdom": 14,
  "Charisma": 8,
  "ArmorClass": 14,
  "MaxHp": 12,
  "CurrentHp": 12,
  "TemporaryHp": 0,
  "Initiative": 8,
  "Speed": "30 ft",
  "PassivePerception": 14,
  "SavingThrowProficiencies": ["Strength", "Dexterity"],
  "SkillProficiencies": ["Athletics", "Survival", "Perception", "Stealth", "Nature"],
  "ToolProficiencies": ["Herbalism Kit", "Singing (voice)"],
  "Languages": ["Common"],
  "IsSpellcaster": false,
  "SpellcastingAbility": null,
  "SpellSaveDC": null,
  "SpellAttackBonus": null,
  "Cantrips": [],
  "SpellsKnown": [],
  "SpellSlots": {},
  "SpellSlotsUsed": {},
  "Equipment": [
    "Leather armor (worn, practical)",
    "Father's hunting jacket (weathered leather, inherited)",
    "Game bag",
    "Hunting knife",
    "Traveler's pack",
    "Herbalism kit",
    "Waterskin",
    "Rope, 50 feet (hemp)",
    "Small collection of snares and traps",
    "Worn map of the district boundaries and fence weaknesses",
    "Flint and steel",
    "Dried meat and foraged roots (3 days' rations)"
  ],
  "Weapons": ["Longbow (Father's bow, well-maintained)", "20 Arrows (hand-fletched)", "Hunting Knife (Dagger)", "Handaxe"],
  "CopperPieces": 5,
  "SilverPieces": 0,
  "GoldPieces": 0,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I watch everything—exits, threats, resources—before I relax, which is never. I don't need anyone, and I don't trust easily. If you're useful, I'll work with you. If you're a threat, I'll handle you. Words are just another way people manipulate each other. I trust what I can see, what I can hunt, what I can hold.",
  "Ideals": "Family. Everything I do is to protect the people I love. I don't care about glory or politics or being a symbol. I care about Prim being fed, about my mother having medicine, about surviving another day. That's enough. That has to be enough.",
  "Bonds": "Prim is everything. I volunteered for death so she wouldn't have to. My father taught me to hunt, to sing, to survive—his bow is the most precious thing I own. The Hawthornes have been my family since the mines took my father; Gale and I keep each other alive. I owe Peeta Mellark a debt I can never repay—the bread he threw me when I was starving saved my life.",
  "Flaws": "I don't know how to trust. Every time someone helps me, I wonder what they want. I can't accept kindness without suspicion. I'm terrible with people—I say the wrong thing, I don't understand what they want from me, I'd rather be silent than get it wrong. When people die, I carry it. Every face. Every name. Even when it's not my fault, it feels like it is.",
  "Backstory": "Katniss Everdeen was eleven years old when the mines took her father.\n\nShe remembers the whistle—the one that meant an accident. She remembers waiting at the pithead with every other family in the Seam, coal dust in the air and fear in their throats. She remembers when they stopped bringing bodies up and started sending condolences instead. Forty-three men died that day. Her father was one of them.\n\nHer mother disappeared after that. Not physically—she was still there, sitting by the cold hearth, staring at nothing. But the woman who had been their mother, who had laughed and sung and made them feel safe, was gone. And Prim was only seven. Someone had to feed them.\n\nKatniss was eleven years old when she became a provider.\n\nShe slipped through the fence—the electric one that was supposed to keep District 12 locked in, the one that was almost never powered because who would waste electricity on the poorest district? She found her father's bow where he'd hidden it, wrapped in oilcloth beneath a hollow log. And she learned to hunt.\n\nThe woods were illegal. The bow was illegal. Trading game at the Hob was illegal. But starving wasn't an option, so Katniss became an outlaw at eleven. She learned which plants were edible, which were medicine, which would kill you. She learned to move silently, to read tracks, to wait for hours in perfect stillness for a single shot. She learned that a squirrel through the eye was worth more than one with a damaged pelt.\n\nShe met Gale in the woods—another hunter's kid turned provider, another mouth to feed and hands to help. They became partners, then friends, then something like family. Together they kept two households alive through winters that killed weaker families.\n\nKatniss learned not to trust the Capitol, because the Capitol had taken her father and would take her at the Reaping if her name came up. She learned not to trust people who offered help, because help always came with strings. She learned not to feel too much, because feelings were a weakness and weakness got you killed.\n\nBut she never learned to stop protecting. Prim's name in the Reaping ball. Prim walking toward the stage on shaking legs. And Katniss's voice cutting through the silence before she even knew she was speaking: *I volunteer. I volunteer as tribute.*\n\nShe doesn't want to be a hero. She doesn't want to be a symbol. She just wants her sister to live.\n\nKatniss Everdeen goes into the arena with her father's hunting skills, her mother's healer's knowledge, and a debt she owes to a baker's son who threw her bread when she was dying in the rain.\n\nShe intends to come home.\n\nShe's good at surviving. She's had practice.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null,
  "Feats": ["Alert"],
  "ClassFeatures": ["Favored Enemy (pending Level 1 choice)", "Natural Explorer (pending Level 1 choice)"],
  "FavoredEnemy": "Beasts",
  "FavoredTerrain": "Forest"
}
