{
  "Name": "Max Mayfield",
  "Type": "PC",
  "Race": "Human (Variant)",
  "Class": "Rogue",
  "Level": 1,
  "Background": "Urchin",
  "Alignment": "Chaotic Good",
  "Strength": 8,
  "Dexterity": 16,
  "Constitution": 13,
  "Intelligence": 14,
  "Wisdom": 10,
  "Charisma": 12,
  "ArmorClass": 14,
  "MaxHp": 9,
  "CurrentHp": 9,
  "TemporaryHp": 0,
  "Initiative": 3,
  "Speed": "30 ft",
  "PassivePerception": 12,
  "SavingThrowProficiencies": ["Dexterity", "Intelligence"],
  "SkillProficiencies": ["Acrobatics", "Perception", "Sleight of Hand", "Stealth", "Investigation", "Deception"],
  "ToolProficiencies": ["Thieves' Tools", "Disguise Kit"],
  "Languages": ["Common", "Thieves' Cant"],
  "IsSpellcaster": false,
  "SpellcastingAbility": null,
  "SpellSaveDC": null,
  "SpellAttackBonus": null,
  "Cantrips": [],
  "SpellsKnown": [],
  "SpellSlots": {},
  "SpellSlotsUsed": {},
  "Equipment": [
    "Leather armor",
    "Skateboard (well-worn, covered in stickers)",
    "Walkman with headphones (plays Kate Bush - 'Running Up That Hill' on repeat)",
    "Backpack",
    "Thieves' tools",
    "Small knife (utility)",
    "Set of common clothes (jeans, flannel shirt)",
    "Denim jacket with patches",
    "Map of local area (marked with shortcuts and hiding spots)",
    "Pet mouse named 'Chester' (kept in pocket)",
    "10 feet of string",
    "Small mirror",
    "Piece of chalk"
  ],
  "Weapons": ["Shortsword", "Shortbow", "20 Arrows", "2 Daggers"],
  "CopperPieces": 0,
  "SilverPieces": 10,
  "GoldPieces": 0,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I don't need anyone to save me—I've been saving myself my whole life. I'd rather be hated for who I am than liked for someone I'm not. When I let people in, I'm loyal to a fault, but they have to earn it first. My skateboard and my music are the only things that have never let me down.",
  "Ideals": "Independence. I won't be controlled by anyone—not by family, not by expectations, not by fear. I make my own choices and I own the consequences. Freedom is worth fighting for.",
  "Bonds": "Lucas saw through my walls and didn't run away. El taught me what real friendship looks like—no judgment, no conditions. The Party accepted me when they didn't have to. I won't lose them, and I won't let anyone hurt them.",
  "Flaws": "I push people away before they can hurt me. It's a reflex—someone gets too close, and I find a way to make them leave. I'm working on it, but old habits are hard to break. Sometimes I convince myself I don't deserve the good things that happen to me.",
  "Backstory": "Max Mayfield learned early that home wasn't always a safe place.\n\nHer parents' divorce left her shuttling between a father who couldn't be bothered to remember her birthday and a mother who tried her best but couldn't protect Max from what came next: Neil Hargrove, her stepfather, and Billy, her stepbrother. Neil's temper filled every room like smoke, and Billy—who bore the worst of his father's rage—passed that violence down the only direction he could.\n\nMax survived by becoming invisible. She learned which floorboards creaked, which moods meant danger, which silences to fill and which to ride out. She learned to make herself small. But when the front door closed behind her, skateboard under her arm, she was untouchable. The wind drowned out the yelling. The speed made everything else blur away.\n\nThen came Hawkins, Indiana. Another new town. Another school where everyone already had their groups and their histories. Max didn't bother learning names—why invest in people you'd lose when the next move came?\n\nBut Hawkins wasn't like the other places.\n\nThere were kids who rode bikes through the night hunting monsters. A girl with powers and a shaved head who didn't know how to smile but learned. A boy named Lucas who kept showing up no matter how many times she pushed him away, who looked at her like she was worth knowing.\n\nMax didn't join the Party because she needed friends. She joined because they needed her—and because somewhere along the way, she started needing them back.\n\nShe's still learning how to do this: how to stay instead of running, how to trust instead of testing, how to accept help without keeping score. The walls are still there, just... with more doors now. When the music hits her ears—Kate Bush singing about making deals with God, about running up hills and swapping places—Max feels like someone finally understands the weight she carries.\n\nShe doesn't talk about Billy. About watching him die. About the complicated grief of losing someone who hurt you but didn't deserve what happened to him. That's locked away, and the key is buried deep.\n\nBut she's still here. Still skating. Still fighting.\n\nAnd when her friends are in danger, Max Mayfield doesn't hide anymore. She runs straight at the problem, because that's what family does—and the Party is the first real family she's ever had.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null,
  "Feats": ["Skulker"],
  "ClassFeatures": ["Sneak Attack (1d6)", "Expertise (Stealth, Acrobatics)", "Thieves' Cant"],
  "Expertise": ["Stealth", "Acrobatics"]
}
