{
  "Name": "Lotney 'Sloth'",
  "Type": "PC",
  "Race": "Goliath",
  "Class": "Barbarian",
  "Level": 1,
  "Background": "Haunted One",
  "Alignment": "Chaotic Good",
  "Strength": 17,
  "Dexterity": 12,
  "Constitution": 16,
  "Intelligence": 6,
  "Wisdom": 10,
  "Charisma": 8,
  "ArmorClass": 14,
  "MaxHp": 15,
  "CurrentHp": 15,
  "TemporaryHp": 0,
  "Initiative": 1,
  "Speed": "30 ft",
  "PassivePerception": 10,
  "SavingThrowProficiencies": ["Strength", "Constitution"],
  "SkillProficiencies": ["Athletics", "Intimidation", "Perception", "Survival"],
  "ToolProficiencies": [],
  "Languages": ["Common", "Giant"],
  "IsSpellcaster": false,
  "SpellcastingAbility": null,
  "SpellSaveDC": null,
  "SpellAttackBonus": null,
  "Cantrips": [],
  "SpellsKnown": [],
  "SpellSlots": {},
  "SpellSlotsUsed": {},
  "Equipment": [
    "Tattered but clean clothes",
    "Superman shirt (worn hidden under other clothes, treasured)",
    "Several Baby Ruth candy bars (emergency comfort food)",
    "Pirate tricorn hat (found, beloved)",
    "Simple rope belt",
    "Traveler's pack",
    "Bedroll",
    "Waterskin",
    "Mess kit",
    "10 torches (carries them for friends who can't see in the dark)",
    "Small hand mirror (still learning what he looks like)",
    "Worn children's book about heroes",
    "Chunk's friendship bracelet (woven string)"
  ],
  "Weapons": ["Greatclub (heavy timber)", "2 Handaxes", "4 Javelins"],
  "CopperPieces": 0,
  "SilverPieces": 0,
  "GoldPieces": 1,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I don't talk much—words are hard, and people sometimes laugh. But I understand more than they think. When someone is kind to me, I remember forever. I will never, ever let someone hurt my friends. SLOTH LOVE CHUNK! I like dark places. They're quiet. Safe. I can see fine, and the darkness feels like a blanket.",
  "Ideals": "Protection. Everyone deserves someone who will fight for them. I didn't have that for a long time. Now I can be that for others. Heroes protect people who can't protect themselves—like Superman. That's what I want to be.",
  "Bonds": "Chunk shared his candy bar when he didn't have to. He was scared of me, but he was still kind. That made him my best friend forever. The Goonies never say die—and neither do I. My new family, the Cohens, showed me what real family is supposed to feel like. I carry the Superman shirt to remind me that even someone who looks like a monster can be a hero.",
  "Flaws": "I am very easily tricked. People use big words or complicated plans, and I get confused. Sometimes I break things by accident because I forget how strong I am. When I get angry—really angry—it's hard to stop. Mama's voice still echoes in my head sometimes, telling me I'm worthless. I'm trying not to believe it anymore.",
  "Backstory": "The Fratellis called him Sloth. A cruel joke—he was anything but slow when it mattered.\n\nHis real name was Lotney, but Mama only used that when she wanted him to feel small. Mama Fratelli ran a criminal empire with an iron fist, and Lotney was her greatest shame: a son born different, a son whose face had been ruined when she dropped him as an infant. She kept him in the basement, chained to the wall, fed through a bucket, forgotten by everyone except his brothers when they needed someone to mock.\n\nThe basement was dark. For years, that darkness was all Lotney knew.\n\nBut Lotney didn't fear the dark. He learned it. He listened to the way sound moved through it, felt the subtle shifts in air that meant someone was coming. The darkness became his friend—the only friend he had for a long, long time. His eyes adjusted. His senses sharpened. While the world above forgot him, Lotney became one with the underground.\n\nHis only window to the outside was a small TV that sometimes worked. Through its flickering light, Lotney discovered heroes. He watched Superman fly and save people and stand up for those who couldn't stand up for themselves. He found an old Superman shirt in the junk they threw down and kept it hidden, wearing it under his rags like armor. Like a promise.\n\n*Someday, I can be like that.*\n\nThen came the day that changed everything.\n\nMama threw a boy down into the basement. Chunk, they called him. A round, scared kid who screamed when he saw Lotney's face. Lotney was used to that—people always screamed.\n\nBut Chunk did something no one had ever done before.\n\nChunk stopped screaming. He looked at Lotney with terrified eyes... and then he reached into his pocket and pulled out a candy bar. A Baby Ruth. And he held it out, hand shaking, and offered to share.\n\n*Here. You want some?*\n\nNo one had ever shared anything with Lotney. No one had ever treated him like a person instead of a monster. That one act of kindness—that one candy bar—broke something open inside him that the chains never could.\n\nWhen Mama came for Chunk, Lotney broke those chains. Literally tore them from the wall with a roar that shook the foundation. He wasn't fighting for himself—he'd long since stopped fighting for himself. He was fighting for the first friend he'd ever had.\n\n*SLOTH LOVE CHUNK!*\n\nHe found the other kids—the Goonies—and they were scared too, at first. But they needed help, and Lotney had spent his whole life waiting to help someone. He swung through the caverns on ropes like the pirates whose ship they'd found. He fought his own brothers. He lifted boulders and bent metal and stood between the children and every danger the caves threw at them.\n\nAnd when it was over, when the treasure was found and Mama was arrested and the Goonies had saved their homes, something miraculous happened: the Cohens took him in. A real family. People who smiled at him and didn't flinch. People who said *good morning* and meant it.\n\nLotney—Sloth—left the chains behind. He doesn't need reminders of what was done to him. He knows who he is now.\n\nBut he kept the Superman shirt. He kept the Baby Ruth wrappers. He kept the pirate hat.\n\nBecause somewhere out there, there are other people trapped in basements. Other kids who need someone to break their chains. Other treasures that need finding, other adventures waiting in the dark.\n\nAnd Sloth is very, very good in the dark.\n\n*Goonies never say die.*",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null,
  "Feats": [],
  "ClassFeatures": ["Rage (2/day)", "Unarmored Defense"],
  "RacialTraits": ["Stone's Endurance", "Powerful Build", "Mountain Born"],
  "RageUses": 2,
  "RageDamage": 2,
  "SpecialAbilities": ["Darkvision (adapted)", "Cave Navigation Expert", "Protective Fury"]
}
