{
  "Name": "Steve Harrington",
  "Type": "PC",
  "Race": "Human (Variant)",
  "Class": "Fighter",
  "Level": 1,
  "Background": "Noble",
  "Alignment": "Neutral Good",
  "Strength": 14,
  "Dexterity": 12,
  "Constitution": 16,
  "Intelligence": 8,
  "Wisdom": 10,
  "Charisma": 14,
  "ArmorClass": 16,
  "MaxHp": 13,
  "CurrentHp": 13,
  "TemporaryHp": 0,
  "Initiative": 1,
  "Speed": "30 ft",
  "PassivePerception": 10,
  "SavingThrowProficiencies": ["Strength", "Constitution"],
  "SkillProficiencies": ["Athletics", "Intimidation", "History", "Persuasion"],
  "ToolProficiencies": [],
  "Languages": ["Common"],
  "IsSpellcaster": false,
  "SpellcastingAbility": null,
  "SpellSaveDC": null,
  "SpellAttackBonus": null,
  "Cantrips": [],
  "SpellsKnown": [],
  "SpellSlots": {},
  "SpellSlotsUsed": {},
  "Equipment": [
    "Chain mail",
    "Shield (emblazoned with Hawkins High Tiger)",
    "Explorer's pack",
    "Fine clothes (letterman jacket)",
    "Signet ring (class ring)",
    "Scroll of pedigree (student ID, family connections)",
    "Sunglasses"
  ],
  "Weapons": ["Nail Bat (Morningstar)", "Light Crossbow", "20 Crossbow Bolts"],
  "CopperPieces": 0,
  "SilverPieces": 0,
  "GoldPieces": 25,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I used to think I had it all figured out. Turns out I didn't know anything. If someone needs help, I'm there—even if it's stupid. Especially if it's stupid. I've gotten pretty good at babysitting a bunch of nerds who keep almost getting themselves killed.",
  "Ideals": "Protection. Everyone deserves someone in their corner. I used to care about being popular and cool, but now I just care about keeping people safe. That's what actually matters.",
  "Bonds": "These kids—Dustin, Mike, Lucas, Max, Will, El—they're my responsibility now. I didn't ask for it, and I'm not exactly qualified, but I'm not walking away. Robin's my best friend, the one person who really knows me. Nancy... it's complicated, but she showed me I could be more than just 'King Steve.'",
  "Flaws": "I still care too much what people think of me—old habits die hard. Sometimes the insecure kid who needed to be popular shows through. I'm not the smartest guy in the room, and I know it. I tend to lead with my bat instead of my brain, and I've taken more beatings than I can count because of it.",
  "Backstory": "Steve Harrington had it all—rich parents, popular friends, the prettiest girl in school, and the unshakeable confidence of someone who'd never faced real consequences. He was King Steve, captain of the basketball team, the guy everyone wanted to be or be with.\n\nThen monsters from another dimension showed up, and everything he thought mattered turned out to be absolutely worthless.\n\nIt started with Nancy Wheeler. She saw through his act, saw the insecurity hiding behind the bravado, and then she was gone—drawn into something darker and stranger than anything Steve's comfortable life had prepared him for. When he finally found the courage to go back for her, bat in hand, he discovered a world of Demogorgons and dimensional rifts and a group of kids who were braver than any of his so-called friends.\n\nHe got his ass kicked. Repeatedly. But he kept showing up.\n\nThe next year brought the Mind Flayer, a pack of demo-dogs, and a curly-haired kid named Dustin who needed a ride to a Snow Ball. Steve didn't plan to become a babysitter to a group of middle schoolers fighting interdimensional evil—it just sort of happened. Somewhere between fighting monsters in the tunnels and giving Dustin dating advice, Steve found something he'd been missing his whole life: a purpose that wasn't about his reflection in someone else's eyes.\n\nHis popularity vanished. His college applications got rejected. He ended up scooping ice cream at Scoops Ahoy in a sailor uniform that should've been humiliating but somehow wasn't, because Robin was there making fun of him, and the kids still came by, and when the Russians built a secret base under the mall, Steve was the one who noticed something was wrong.\n\nHe's been beaten, drugged, tortured, chased by Russians and monsters alike. His face has taken so much damage that it's practically a running joke. But every time he goes down, he gets back up—not because he's the strongest or the smartest, but because those kids are counting on him.\n\nSteve Harrington used to be King of Hawkins High. Now he's just a guy with a nail bat, questionable job history, and a bunch of children who keep almost dying on his watch. And somehow, that's better than being King ever was.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null,
  "FightingStyle": "Protection",
  "Feats": ["Sentinel"],
  "ClassFeatures": ["Second Wind", "Fighting Style: Protection"]
}
