{
  "Name": "Will the Wise",
  "Type": "PC",
  "Race": "Human",
  "Class": "Wizard",
  "Level": 5,
  "Background": "Haunted One",
  "Alignment": "Neutral Good",
  "Strength": 8,
  "Dexterity": 14,
  "Constitution": 12,
  "Intelligence": 17,
  "Wisdom": 14,
  "Charisma": 10,
  "ArmorClass": 12,
  "MaxHp": 27,
  "CurrentHp": 27,
  "TemporaryHp": 0,
  "Initiative": 2,
  "Speed": "30 ft",
  "PassivePerception": 14,
  "SavingThrowProficiencies": ["Intelligence", "Wisdom"],
  "SkillProficiencies": ["Arcana", "Investigation", "Perception", "Survival"],
  "ToolProficiencies": ["Painter's Supplies"],
  "Languages": ["Common", "Abyssal", "Deep Speech"],
  "IsSpellcaster": true,
  "SpellcastingAbility": "Intelligence",
  "SpellSaveDC": 14,
  "SpellAttackBonus": 6,
  "Cantrips": ["Fire Bolt", "Light", "Minor Illusion", "Prestidigitation"],
  "SpellsKnown": [
    "Detect Magic", "Find Familiar", "Mage Armor", "Magic Missile", "Shield",
    "Detect Thoughts", "Misty Step", "See Invisibility",
    "Fireball", "Counterspell"
  ],
  "SpellSlots": { "1": 4, "2": 3, "3": 2 },
  "SpellSlotsUsed": { "1": 0, "2": 0, "3": 0 },
  "Equipment": [
    "Spellbook (worn, filled with notes and sketches)",
    "Arcane Focus (crystal pendant)",
    "Scholar's Pack",
    "Sketchbook and charcoal pencils",
    "Worn journal filled with drawings of the Upside Down",
    "Common clothes",
    "Hooded cloak",
    "Blanket",
    "Small music box (gift from mom)",
    "Walkie-talkie (magical sending stone)"
  ],
  "Weapons": ["Dagger", "Quarterstaff"],
  "CopperPieces": 5,
  "SilverPieces": 12,
  "GoldPieces": 8,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I'm quiet and often overlooked, but I notice everything—especially things others miss, like shadows that move wrong or cold spots in warm rooms. I express my feelings through art when words fail me. Sometimes I just want things to go back to how they were before, when we could just play games and be kids.",
  "Ideals": "Friendship. The Party is everything. My friends came for me when I was lost in the dark, and I would walk through any nightmare for them. We're stronger together than any of us alone.",
  "Bonds": "My friends—Mike, Dustin, Lucas, Eleven—are my family as much as my mom and brother Jonathan. They never gave up on me when I was trapped in the Upside Down. My mom's love is a light that guided me home. I carry drawings of the shadow realm because understanding the enemy is how we defeat it.",
  "Flaws": "Part of me is still connected to the Upside Down. I sense things from that place—cold presences, the Mind Flayer's shadow—and it terrifies me. I often feel like I don't quite fit in anymore, like I'm watching my friends grow up and move on while I'm stuck. When the visions come, I freeze up and become almost useless.",
  "Backstory": "Will was always the quiet one in the Party—the shy, artistic kid who'd rather draw than talk, who found magic in games and wonder in stories. He was the first to roll a natural 20, the one who always played the wizard, the friend who believed in impossible things.\n\nThen the impossible became terrifyingly real.\n\nTaken by the Demogorgon to the Upside Down—a nightmarish shadow dimension of decay and predators—Will survived for a week in absolute darkness, hiding, running, reaching desperately toward the lights his mom kept burning for him. His friends never stopped looking. They found a girl with powers who could find him. His mom's love pierced dimensions. And when he finally stumbled back through the portal, gasping and changed, he thought the nightmare was over.\n\nIt wasn't.\n\nThe Mind Flayer had noticed him. Made him a host, a spy, a vessel. Will felt the creature's presence like ice in his veins, saw through its countless eyes, heard its terrible hunger. Even after being freed from its control, the connection remained—a curse and, perhaps, an unexpected weapon. He can still sense when the shadow is near, still feels the cold creeping at the edge of his perception.\n\nWill threw himself into his studies of the arcane, learning to control fire—because the Mind Flayer fears heat and flame. His signature spell became Fireball, a blazing declaration that he would never be a victim again. But despite his growing power, he struggles with the feeling that he's lost something he can't name—that his friends are all moving forward while he's anchored to the darkness that touched him.\n\nWill the Wise ventures forth with his sketchbook and his spells, a boy who has seen true horror and chosen to fight it anyway. He may be quiet, he may be overlooked, but when the shadows rise, he'll be the one casting Fireball into the dark.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null
}
