{
  "Name": "Zeke Shadowstep",
  "Type": "PC",
  "Race": "Lightfoot Halfling",
  "Class": "Rogue",
  "Level": 5,
  "Background": "Criminal",
  "Alignment": "Chaotic Good",
  "Strength": 8,
  "Dexterity": 18,
  "Constitution": 14,
  "Intelligence": 12,
  "Wisdom": 10,
  "Charisma": 14,
  "ArmorClass": 15,
  "MaxHp": 38,
  "CurrentHp": 38,
  "TemporaryHp": 0,
  "Initiative": 4,
  "Speed": "25 ft",
  "PassivePerception": 13,
  "SavingThrowProficiencies": ["Dexterity", "Intelligence"],
  "SkillProficiencies": ["Acrobatics", "Deception", "Investigation", "Perception", "Sleight of Hand", "Stealth"],
  "ToolProficiencies": ["Thieves' Tools", "Dice Set", "Forgery Kit"],
  "Languages": ["Common", "Halfling", "Thieves' Cant"],
  "IsSpellcaster": false,
  "SpellcastingAbility": null,
  "SpellSaveDC": null,
  "SpellAttackBonus": null,
  "Cantrips": [],
  "SpellsKnown": [],
  "SpellSlots": {},
  "SpellSlotsUsed": {},
  "Equipment": [
    "Leather Armor",
    "Burglar's Pack",
    "Thieves' Tools",
    "Hooded Lantern",
    "50 feet of Hempen Rope",
    "Crowbar",
    "Dark common clothes with hood",
    "Belt pouch with false bottom",
    "Set of weighted dice",
    "Lucky rabbit's foot"
  ],
  "Weapons": ["Rapier", "Shortsword", "Shortbow", "40 Arrows", "2 Daggers"],
  "CopperPieces": 23,
  "SilverPieces": 45,
  "GoldPieces": 128,
  "PlatinumPieces": 0,
  "PersonalityTraits": "I always have a plan for what to do when things go wrong. The first thing I do in a new place is note the locations of everything valuable—or where such things could be hidden. I blow my coin on extravagant parties because tomorrow might never come.",
  "Ideals": "Freedom. Chains are meant to be broken, as are those who would forge them. No one should have to bow and scrape to earn their bread.",
  "Bonds": "I'm trying to pay off an old debt I owe to a generous benefactor who helped me escape my past. Someone I loved died because of a mistake I made. That will never happen again.",
  "Flaws": "When I see something valuable, I can't think about anything but how to steal it. I have a 'tell' that reveals when I'm lying—I scratch behind my ear. I turn tail and run when things look bad, though I always come back for my friends.",
  "Backstory": "Zeke grew up in the cramped warrens beneath Waterdeep's Dock Ward, one of countless orphan pickpockets working for a crime boss known as 'The Collector.' He learned to move unseen, to pick locks by touch alone, and that the only person he could truly rely on was himself. When he was sixteen, a heist went wrong and his best friend Pip was killed by city guards while Zeke escaped. Wracked with guilt, he fled Waterdeep and spent years wandering, using his skills to rob from corrupt nobles and share with the poor. A chance encounter with a traveling sage named Aldric changed his life—the old man saw potential in Zeke and paid off his debts to The Collector, asking only that Zeke use his talents for good. Now Zeke seeks to honor that debt by helping those who cannot help themselves, though he's never quite shaken the thrill of a perfectly executed heist. He still sends coin anonymously to Pip's younger sister in Waterdeep.",
  "Conditions": [],
  "StatusNotes": null,
  "DeathSaveSuccesses": 0,
  "DeathSaveFailures": 0,
  "PlayerId": null,
  "PlayerName": null
}
